In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
data = { 

    "Imię": ["Ala", "Bartek", "Celina"], 

    "Wiek": [22, 25, 20], 

    "Ocena": [4.5, 3.8, 5.0] 

}

In [3]:
df = pd.DataFrame(data)
display(df)
print(df.describe())

     Imię  Wiek  Ocena
0     Ala    22    4.5
1  Bartek    25    3.8
2  Celina    20    5.0

            Wiek     Ocena
count   3.000000  3.000000
mean   22.333333  4.433333
std     2.516611  0.602771
min    20.000000  3.800000
25%    21.000000  4.150000
50%    22.000000  4.500000
75%    23.500000  4.750000
max    25.000000  5.000000

In [4]:
year = [2000, 1998, 2001]
df['Rok Studiów'] = year
display(df)

     Imię  Wiek  Ocena  Rok Studiów
0     Ala    22    4.5         2000
1  Bartek    25    3.8         1998
2  Celina    20    5.0         2001

In [5]:
print(df.describe())

            Wiek     Ocena  Rok Studiów
count   3.000000  3.000000     3.000000
mean   22.333333  4.433333  1999.666667
std     2.516611  0.602771     1.527525
min    20.000000  3.800000  1998.000000
25%    21.000000  4.150000  1999.000000
50%    22.000000  4.500000  2000.000000
75%    23.500000  4.750000  2000.500000
max    25.000000  5.000000  2001.000000

In [8]:
print(df['Ocena'].mean())

4.433333333333334

In [12]:
rlst_df = df[df['Ocena']>4]
print('\nResult:\n ', rlst_df)
display(rlst_df)

Result:
       Imię  Wiek  Ocena  Rok Studiów
0     Ala    22    4.5         2000
2  Celina    20    5.0         2001

     Imię  Wiek  Ocena  Rok Studiów
0     Ala    22    4.5         2000
2  Celina    20    5.0         2001